read_verilog transactionLayer.v
hierarchy -check -top transactionLayer 
proc; opt; fsm; opt; memory; opt;
techmap; opt
dfflibmap -liberty cmos_cells.lib
abc -liberty cmos_cells.lib
write_verilog transactionLayer_synth.v
